КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм/КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм</name>
  <resources>
    <name>ДанныеСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ТелефонНеЗарегестрирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьДанныеСообщения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьДанныеСообщения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Телефон", Запись.Телефон);
	Запрос.УстановитьПараметр("ДатаАктуальности", Запись.ДатаАктуальности);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.ДанныеСообщения КАК ДанныеСообщения
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм КАК КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм
	|ГДЕ
	|	КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.Телефон = &Телефон
	|	И КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.ДатаАктуальности = &ДатаАктуальности";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Данные = Выборка.ДанныеСообщения.Получить();
		
		Если Данные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого ТекущееСообщение Из Данные Цикл
			НоваяСтрока = ДанныеСообщения.Добавить();
			НоваяСтрока.ТипСообщения = ТекущееСообщение.Тип;
			Если ЗначениеЗаполнено(ТекущееСообщение.ИмяФайла) Тогда
				НоваяСтрока.ДанныеСообщения = "Имя файла: " + ТекущееСообщение.ИмяФайла;
			Иначе
				НоваяСтрока.ДанныеСообщения = ПолучитьТекстСообщения(ТекущееСообщение.Данные);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстСообщения(ДанныеСообщения)
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("txt");
	ДанныеСообщения.Записать(ВременныйФайл);
	
	ПотокЧтения = Новый ЧтениеТекста(ВременныйФайл);
	
	Попытка
		ТекстСообщения = ПотокЧтения.Прочитать();
	Исключение
		ТекстСообщения = "Не удалось прочитать текст сообщения!";
	КонецПопытки;
	
	ПотокЧтения.Закрыть();
	
	УдалитьФайлы(ВременныйФайл);
	
	Возврат ТекстСообщения;
	
КонецФункции

#КонецОбласти
